---
kind: type
id: T:Autodesk.Revit.DB.MassInstanceUtils
source: html/c1918834-8fe4-b8fb-10bf-39c59ae34eeb.htm
---
# Autodesk.Revit.DB.MassInstanceUtils

A static class that contains methods for processing curves driven by points.

## Syntax (C#)
```csharp
public class MassInstanceUtils : IDisposable
```